# AttemptToConnectNonSlopingElementToSlopedPipeWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..AttemptToConnectNonSlopingElementToSlopedPipeWarning Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AttemptToConnectNonSlopingElementToSlopedPipeWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AttemptToConnectNonSlopingElementToSlopedPipeWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AttemptToConnectNonSlopingElementToSlopedPipeWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace